FlapCHTBlockMesh2/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       47636;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       47756;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       47876;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          204;
        startFace       48068;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          48000;
        startFace       48272;
    }
    flapHole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          92;
        startFace       96272;
    }
)

// ************************************************************************* //
