FlapCHTBlockMesh2/Fluid/system/surfaceFeatureExtractDict
/*----------------------------------*
* surfaceFeatureExtractDict       *
*----------------------------------*/

geometry
{
flap.stl
{
type triSurfaceMesh;
name flap;
}
}

features
(
{
file "flap.eMesh";   // File di output per le caratteristiche
level 2;             // Livello di precisione
}
);

